app/controllers/categories_controller.rb

    def index
        cat = Category.all
---
SELECT "categories".* FROM "categories"

    def create
        cat = Category.create!(category_params)
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Appetizer"], ["description", "light morning food"], ["created_at", "2023-03-31 07:03:23.860560"], ["updated_at", "2023-03-31 07:03:23.860560"]]

    def destroy
        # check whether the task exists
        cat = Category.find_by(id:params[:id])

       #  delete the task
       if cat
           cat.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]