app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipe = Recipe.all

INSERT INTO "recipes" ("title", "instructions", "ingredients", "prep_time", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        recipe = Recipe.create(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
    def destroy
        # check whether the task exists
        recipe = Recipe.find_by(id:params[:id])

       #  delete the task
       if recipe
           recipe.destroy