app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 2], ["user_id", 12], ["recipe_id", 6], ["created_at", "2023-04-02 13:41:29.458044"], ["updated_at", "2023-04-02 13:41:29.458044"]]
---
    def create
        review = Review.create!(review_params)